<?php
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
{
$permissions = [
    'الفواتير',
    'قائمة الفواتير',
    'الفواتير المدفوعه',
    'الفواتير المدفوعه جزئيا',
    'الفواتير الغير مدفوعه',
    'ارشيف الفواتير',
    'التقارير',
    'تقرير الفواتير',
    'تقرير العملاء',
    'المستخدمين',
    'قائمة المستخدمين',
    'صلاحيات المستخدمين',
    'الاعدادات',
    'المنتجات',
    'الاقسام',


    'اضافة فاتوره',
    'حذف الفاتوره',
    'تصدير EXCEL',
    'تغير حالة الدفع',
    'تعديل الفاتوره',
    'ارشفة الفاتوره',
    'طباعة الفاتوره',
    'اضافة مرفق',
    'حذف المرفق',

    'اضافة مستخدم',
    'تعديل مستخدم',
    'حذف مستخدم',

    'عرض صلاحيه',
    'اضافة صلاحيه',
    'تعديل صلاحيه',
    'حذف صلاحيه',

    'اضافة منتج',
    'تعديل منتج',
    'حذف منتج',

    'اضافة قسم',
    'تعديل قسم',
    'حذف قسم',
    'الاشعارات',


];
foreach ($permissions as $permission) {
Permission::create(['name' => $permission]);

}
}
}
